odrxRealloc(System.Void*,System.UInt64,System.UInt64)
\details
Reallocates a block of memory.
\param pMemBlock [in]  Pointer to the previously allocated memory block.
\param newSize [in]  New size in bytes.
\param oldSize [in]  Old size in bytes.
\returns
Returns a pointer to the newly allocated memory block.
\sa
Memory Management